//==============================================================================
//							 NativeHook.h
//							   
// begin	: 2016/12/8
// describe	: 本地钩子
//==============================================================================

#ifndef NATIVEHOOK_H
#define NATIVEHOOK_H

//==============================================================================
//
//							  CNativeHook
//							   本地化钩子
//
//==============================================================================

class CNativeHook
{
public:
	CNativeHook();
	~CNativeHook();
	
private:
	// 设定钩子
	void SetHook();
	// 取消钩子
	void CancelHook();
};
#endif	// NATIVEHOOK_H

